ErpTest/src/Catalogs/пкПользователиМП/пкПользователиМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пкПользователиМП</name>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыАрендаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыЛогистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСогласованиеЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПраваЛогиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КогоЗамещает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/пкПользователиМП/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЭтоНовый() И ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Запрос       = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	пкПользователиМП.Ссылка
		|ИЗ
		|	Справочник.пкПользователиМП КАК пкПользователиМП
		|ГДЕ
		|	пкПользователиМП.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
		|	И пкПользователиМП.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("ИдентификаторПользователяИБ",ИдентификаторПользователяИБ);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Если Не Запрос.Выполнить().Пустой() Тогда
			ИдентификаторПользователяИБ = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
		
	ЭлектроннаяПочта = НРег(СокрЛП(ЭлектроннаяПочта));
	
	Если ПометкаУдаления И ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ <> Неопределено Тогда
			мПользовательИБ.Удалить();
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ИдентификаторПользователяИБ)Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	Иначе	
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ = Неопределено Тогда
			мПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();   
		КонецЕсли;	
	КонецЕсли;
	
	мПользовательИБ.АутентификацияСтандартная = Истина;
	мПользовательИБ.Имя                       = Наименование;
	мПользовательИБ.ЗапрещеноИзменятьПароль   = Истина;
	мПользовательИБ.Пароль                    = Пароль;
	мПользовательИБ.ПолноеИмя                 = Наименование;
	мПользовательИБ.ПоказыватьВСпискеВыбора   = Ложь;

	мРоли = мПользовательИБ.Роли;
	мРоли.Очистить();
	мРоли.Добавить(Метаданные.Роли.БазовыеПраваБСП);
	мРоли.Добавить(Метаданные.Роли.пкДоступКМобильнойПодсистеме);
	мРоли.Добавить(Метаданные.Роли.пкПодтверждениеЗаявокНаАрендуТехники);
	
	мПользовательИБ.Записать();
	
	ИдентификаторПользователяИБ = мПользовательИБ.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		мПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если мПользовательИБ <> Неопределено Тогда
			мПользовательИБ.Удалить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторПользователяИБ = Неопределено;
КонецПроцедуры
